UB_Copy/src/InformationRegisters/УБ_ФормулыПоказателейЭффективности/УБ_ФормулыПоказателейЭффективности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ФормулыПоказателейЭффективности</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>МодельПланирования</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоказательЭффективности</name>
    <type>
      <types>CatalogRef.УБ_ТипыПоказателей</types>
      <types>CatalogRef.УБ_ПоказателиЭффективности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияГрейда</name>
    <type>
      <types>CatalogRef.УБ_ВерсииГрейдов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_ФормулыПоказателейЭффективности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьФормулыПоказателейЭффективности(ДанныеДокументаУтвержденияГрейда) Экспорт
		
	НаборЗаписей = РегистрыСведений.УБ_ФормулыПоказателейЭффективности.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокументаУтвержденияГрейда);
		
	Для Каждого СтрокаТЧ Из ДанныеДокументаУтвержденияГрейда.ФормулыРасчета Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ПоказательЭффективности) 
			И ЗначениеЗаполнено(СтрокаТЧ.ФормулаРасчета) И ЗначениеЗаполнено(СтрокаТЧ.Ячейка) Тогда
			//Отбор = Новый Структура;
			//Отбор.Вставить("ПоказательЭффективности",СтрокаТЧ.ПоказательЭффективности);
			//ДанныеПоказателя = ДанныеДокументаУтвержденияГрейда.Показатели.НайтиСтроки(Отбор);
			Запись = НаборЗаписей.Добавить();
			Запись.Период = ДанныеДокументаУтвержденияГрейда.Дата; 
			Запись.МодельПланирования = ДанныеДокументаУтвержденияГрейда.МодельПланированияЭффективности;
			Запись.Грейд = ДанныеДокументаУтвержденияГрейда.Грейд;
			Запись.ВерсияГрейда = ДанныеДокументаУтвержденияГрейда.ВерсияГрейда;
			Запись.ПоказательЭффективности = СтрокаТЧ.ПоказательЭффективности;
			Запись.ФормулаРасчета = СтрокаТЧ.ФормулаРасчета;
			Запись.Ячейка = СтрокаТЧ.Ячейка;
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого Строка из ДанныеДокументаУтвержденияГрейда.ТипыПоказателей Цикл
		Если ЗначениеЗаполнено(Строка.ТипПоказателя) 
			И ЗначениеЗаполнено(Строка.ФормулаРасчета) Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Период = ДанныеДокументаУтвержденияГрейда.Дата; 
			Запись.МодельПланирования = ДанныеДокументаУтвержденияГрейда.МодельПланированияЭффективности;
			Запись.Грейд = ДанныеДокументаУтвержденияГрейда.Грейд;
			Запись.ВерсияГрейда = ДанныеДокументаУтвержденияГрейда.ВерсияГрейда;
			Запись.ПоказательЭффективности = Строка.ТипПоказателя;
			Запись.ФормулаРасчета = Строка.ФормулаРасчета;
			Если Строка.ТипПоказателя.Матричный Тогда
				Запись.Ячейка = "ПроцентПремии";
			Иначе
				Запись.Ячейка = "Сумма";
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
